'use strict';

require('dotenv').config();
const { Telegraf } = require('telegraf');

const bot = new Telegraf(process.env.token);
const randomValue = arr => arr[Math.floor(Math.random() * arr.length)];

const virshi = [
  'Знов весна, і знов надії\n' +
  'В серці хворім оживають,\n' +
  'Знов мене колишуть мрії,\n' +
  'Сни про щастя навівають.\n' +
  'Весно красна! Любі мрії!\n' +
  'Сни мої щасливі!\n' +
  'Я люблю вас, хоч і знаю,\n' +
  'Що ви всі зрадливі…',

  'Hi долі, ні волі у мене нема,\n' +
  'Зосталася тільки надія одна:\n' +
  'Надія вернутись ще раз на Вкраїну,\n' +
  'Поглянути ще раз на рідну країну,\n' +
  'Поглянути ще раз на синій Дніпро, —\n' +
  'Там жити чи вмерти, мені все одно;\n' +
  'Поглянути ще раз на степ, могилки,\n' +
  'Востаннє згадати палкі? гадки…\n' +
  'Ні долі, ні волі у мене нема,\n' +
  'Зосталася тільки надія одна.',

  'Прилинь до мене, чарівнице мила,\n' +
  'І запалай зорею надо мною,\n' +
  'Нехай на мене промінь твій впаде,\n' +
  'Бо знов перемогла мене ворожа сила,\n' +
  'Знов подолана я, не маю сил до бою, –\n' +
  'Я не журюсь, я знала – се прийде.\n' +
  'Спокійна я, боротися не хочу.\n' +
  'В душі у мене іншії бажання:\n' +
  'Я тільки думкою на світі буду жить,\n' +
  'Я хочу слухать річ твою урочу\n' +
  'І на своїм чолі твоє сіяння\n' +
  'Почуть бажаю хоч єдину мить.',

  'Натура гине – вся в оздобах, в злоті, –\n' +
  'Останній усміх ясний посила\n' +
  'І краскою непевною пала,\n' +
  'Немов конаюча вродливиця в сухоті.\n' +
  'Недавно ще була вона в турботі,\n' +
  'Жила і працею щасливая була;\n' +
  'Тепер останнії дарунки роздала\n' +
  'І тихо умира… кінець її роботі!\n' +
  'Спокійно умира і листом покриває\n' +
  'Росинки білії, ті сльози самотні\n' +
  'Від сонця ясного і від людей ховає.\n' +
  'Натура ллє ті сльози таємні\n' +
  'Того, що хутко ляже в смертнім сні,\n' +
  'В холодній, білій сніговій труні.',

  'З вітром весняним сосна розмовляла,\n' +
  'Вічно зелена сосна.\n' +
  'Там я ходила і все вислухала,\n' +
  'Що говорила вона.\n' +
  'Ой, не “зеленого шума” співала\n' +
  'Вічно смутная сосна…\n' +
  'Ні, не “зеленого шума”!\n' +
  'Чулася в гомоні тяжка зимовая дума.\n' +
  'Ранком зимовим діброва мовчала,\n' +
  'Наче замерла сумна,\n' +
  'Тільки рясним верховіттям шептала\n' +
  'Вічно зелена сосна;\n' +
  'Там я ходила і все вислухала,\n' +
  'Що говорила вона, —\n' +
  'Та не веселая дума\n' +
  'Чулася в гомоні того “зеленого шума”!..',

  'Дивилась я на тебе і в ту мить\n' +
  'нестямилась, як руки самохіть\n' +
  'для тебе почали вінок сплітати, –\n' +
  'була твоя краса, як ті гранати…',

  'На зеленому горбочку,\n' +
  'У вишневому садочку,\n' +
  'Притулилася хатинка,\n' +
  'Мов маленькая дитинка\n' +
  'Стиха вийшла виглядати,\n' +
  'Чи не вийде її мати.\n' +
  'І до білої хатинки,\n' +
  'Немов мати до дитинки,\n' +
  'Вийшло сонце, засвітило\n' +
  'І хатинку звеселило.',

  'Стояла я і слухала весну,\n' +
  'Весна мені багато говорила,\n' +
  'Співала пісню дзвінку, голосну\n' +
  'То знов таємно-тихо шепотіла.\n' +
  'Вона мені співала про любов,\n' +
  'Про молодощі, радощі, надії,\n' +
  'Вона мені переспівала знов\n' +
  'Те, що давно мені співали мрії.',

  'Скрізь, де не гляну, сухі тумани розляглися,\n' +
  'поле і гай у серпанки тонкі повилися,\n' +
  'марево біле покрило і річку, й сагу,\n' +
  'вітер з полудня несе без кінця ту югу.\n' +
  '\n' +
  'Світло сліпить, та не грає веселе проміння,\n' +
  'вітер гуде, та задуха гнітить, мов каміння.\n' +
  'Так у розлуці з тобою кохання моє\n' +
  'світить і смутить, буяє й життя не дає.',
]

bot.start(ctx => {
  ctx.reply('Привіт!\n' +
    'Я допоможу тобі вибрати, який вірш Лесі Українки вчити наступним!\n' +
    'Для цього використовуй команду /virsh');
});

bot.help(ctx => {
  ctx.reply('Привіт!\n' +
    'Я допоможу тобі вибрати, який вірш Лесі Українки вчити наступним!\n' +
    'Для цього використовуй команду /virsh');
});

bot.command('virsh', ctx => {
  ctx.reply(randomValue(virshi));
})

bot.launch().then(() => console.log('Bot has successfully started!'));
